import React from 'react'

export class Content extends React.Component{
    constructor(props) {
        super(props);
        this.setRandomColor = this.setRandomColor.bind(this);
    }

    getRandomColor() {
        return "#" + Math.floor(Math.random()*16777215).toString(16);
    }
    setRandomColor(element){
        element.target.style.background = this.getRandomColor();
        element.target.style.color = this.getRandomColor();
    }
    render() {
        return (
            <div>
                <p>Місце народження: 1 лютого, 2002 року, м.Суми</p>
                <p>Освіта:Сумська Класична Гімназія, м.Суми</p>
                <p onClick={this.setRandomColor}>НТУУ "КПІ", м.Київ</p>
                <h2 onClick={this.setRandomColor}>Хоббі</h2>
                <ul>
                    <li>Баскетбол</li>
                    <li>Комп'ютерні ігри</li>
                    <li>Японська/Корейська літератури</li>
                    <li>Музика</li>
                </ul>

                <p>Улюблені фільми:</p>

                <ol>
                    <li>Початок</li>
                    <li>Втеча з Шоушенка</li>
                    <li>Список Шиндлера</li>
                    <li>Похмілля у Вегасі</li>
                </ol>

                <p>Барселона (кат., ісп. Barcelona) — місто на північному сході Іспанії, столиця Каталонії. Це найбільший мегаполіс на березі Середземного моря з населенням більше півтора мільйона чоловік і другий за величиною в країні. Барселона — це жваве приморське місто і порт з чудовою культурною та історичною спадщиною, унікальною атмосферою і чарівною архітектурою. Центр Каталонії приваблює своїм м’яким кліматом і розслабленим способом життя, сюрреалістичними будівлями — шедеврами Гауді, пляжами та морем, смачною їжею та розвагами на будь-який смак.
Визначні пам’ятки Барселони охоплюють майже 2000 років її історії й включають: середньовічне старе місто, унікальну сітку вулиць, яка відбиває тенденції міського планування 19 століття і безліч цікавих, незвичайних і навіть трохи казкових споруд. З яких особливо виділяються архітектурні шедеври Антоніо Гауді.</p>

            </div>
        );
    }
};